 ### Automated Terraform Plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vnet.data.modtm_module_source.telemetry[0]: Reading...
module.identities.module.application_registration.random_uuid.maintainers: Refreshing state... [id=ef3d0c8a-98a1-7d1e-2c10-18f0815bd6c7]
module.vnet.random_uuid.telemetry[0]: Refreshing state... [id=76998b8d-ad33-14b4-b2e2-5b5c7ff6f33a]
module.vnet.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.identities.data.azuread_service_principal.terraform: Reading...
module.identities.data.azuread_user.main_keyvault_secret_writer["3b48f167-cb68-4655-b45b-878e170af84d"]: Reading...
module.identities.azuread_group.admin_kubernetes_cluster: Refreshing state... [id=/groups/0bc3f96c-4c3c-4872-ad07-6453e0458993]
module.identities.azuread_group.sensitive_data_observer: Refreshing state... [id=/groups/e2521269-f846-4f6d-a012-ffe87251fc2d]
module.identities.data.azuread_user.main_keyvault_secret_writer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Reading...
module.identities.data.azuread_user.main_keyvault_secret_writer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Reading...
module.identities.azuread_group.main_keyvault_secret_writer: Refreshing state... [id=/groups/c95a1359-d312-4224-88e6-236ab454edd7]
module.identities.data.azuread_user.main_keyvault_secret_writer["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Reading...
module.identities.azuread_group.devops: Refreshing state... [id=/groups/8a2bab6e-28e6-4ed2-a9f9-4826d81c9e76]
module.identities.data.azuread_service_principal.terraform: Read complete after 1s [id=/servicePrincipals/8358d79e-6030-43d7-8c6f-7185ee41482e]
module.identities.data.azuread_user.gitops_maintainer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Reading...
module.identities.data.azuread_user.main_keyvault_secret_writer["3b48f167-cb68-4655-b45b-878e170af84d"]: Read complete after 2s [id=/users/3b48f167-cb68-4655-b45b-878e170af84d]
module.identities.data.azuread_user.gitops_maintainer["3b48f167-cb68-4655-b45b-878e170af84d"]: Reading...
module.identities.data.azuread_user.main_keyvault_secret_writer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Read complete after 2s [id=/users/084a1c45-5010-4aab-bab6-7b86a9d10e5c]
module.identities.data.azuread_user.gitops_maintainer["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Reading...
module.identities.data.azuread_user.main_keyvault_secret_writer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Read complete after 2s [id=/users/4b89a1f0-8038-4929-81e6-6d128dac7aa0]
module.identities.data.azuread_user.gitops_maintainer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Reading...
module.identities.data.azuread_user.main_keyvault_secret_writer["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Read complete after 2s [id=/users/45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff]
module.identities.data.azuread_application_published_app_ids.well_known: Reading...
module.identities.data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
module.identities.data.azuread_user.cluster_admin["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Reading...
module.identities.data.azuread_client_config.current: Reading...
module.identities.data.azuread_client_config.current: Read complete after 0s [id=aeade8c4-d4f7-4ae7-9149-4975fa3a7f91-a0e34ba0-b64c-49f4-8d94-1c74d7b3090e-8358d79e-6030-43d7-8c6f-7185ee41482e]
module.identities.data.azuread_user.cluster_admin["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Reading...
module.identities.data.azuread_user.cluster_admin["3b48f167-cb68-4655-b45b-878e170af84d"]: Reading...
module.identities.data.azuread_user.cluster_admin["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Reading...
module.identities.data.azuread_user.telemetry_observer["3b48f167-cb68-4655-b45b-878e170af84d"]: Reading...
module.identities.data.azuread_user.gitops_maintainer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Read complete after 2s [id=/users/084a1c45-5010-4aab-bab6-7b86a9d10e5c]
module.identities.azuread_group.telemetry_observer: Refreshing state... [id=/groups/a1580a18-80b6-4439-9b23-ac9097850840]
module.identities.data.azuread_user.gitops_maintainer["3b48f167-cb68-4655-b45b-878e170af84d"]: Read complete after 1s [id=/users/3b48f167-cb68-4655-b45b-878e170af84d]
module.identities.azuread_group.emergency_admin: Refreshing state... [id=/groups/ce8a3b5f-66c6-41a1-92f4-90868321a885]
module.identities.data.azuread_user.telemetry_observer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Reading...
module.identities.data.azuread_user.gitops_maintainer["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Read complete after 2s [id=/users/45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff]
module.identities.data.azuread_user.telemetry_observer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Reading...
module.identities.data.azuread_user.gitops_maintainer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Read complete after 2s [id=/users/4b89a1f0-8038-4929-81e6-6d128dac7aa0]
module.identities.data.azuread_user.telemetry_observer["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Reading...
module.identities.data.azuread_user.cluster_admin["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Read complete after 2s [id=/users/084a1c45-5010-4aab-bab6-7b86a9d10e5c]
module.identities.azuread_service_principal.msgraph: Refreshing state... [id=/servicePrincipals/29c402c3-5bb1-4677-9a9b-80f77cd74944]
module.identities.data.azuread_user.cluster_admin["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Read complete after 1s [id=/users/45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff]
module.identities.data.azurerm_role_definition.grafana_viewer: Reading...
module.identities.data.azuread_user.cluster_admin["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Read complete after 1s [id=/users/4b89a1f0-8038-4929-81e6-6d128dac7aa0]
module.identities.data.azurerm_role_definition.contributor: Reading...
module.identities.data.azuread_user.cluster_admin["3b48f167-cb68-4655-b45b-878e170af84d"]: Read complete after 1s [id=/users/3b48f167-cb68-4655-b45b-878e170af84d]
module.identities.data.azurerm_subscription.current: Reading...
module.identities.data.azurerm_role_definition.grafana_viewer: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769]
azurerm_resource_group.vnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002]
module.identities.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.vnet.data.azurerm_client_config.this: Reading...
module.vnet.data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hMGUzNGJhMC1iNjRjLTQ5ZjQtOGQ5NC0xYzc0ZDdiMzA5MGU7b2JqZWN0SWQ9ODM1OGQ3OWUtNjAzMC00M2Q3LThjNmYtNzE4NWVlNDE0ODJlO3N1YnNjcmlwdGlvbklkPWJlNGU4MmZmLWJmODMtNDE3My1hNzUwLTE1ZTgwNzg0NTU3OTt0ZW5hbnRJZD1hZWFkZThjNC1kNGY3LTRhZTctOTE0OS00OTc1ZmEzYTdmOTE=]
module.identities.azurerm_resource_group.core: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core]
module.identities.data.azuread_user.telemetry_observer["3b48f167-cb68-4655-b45b-878e170af84d"]: Read complete after 1s [id=/users/3b48f167-cb68-4655-b45b-878e170af84d]
module.identities.data.azurerm_role_definition.reader: Reading...
module.vnet.data.azurerm_client_config.telemetry[0]: Reading...
module.vnet.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hMGUzNGJhMC1iNjRjLTQ5ZjQtOGQ5NC0xYzc0ZDdiMzA5MGU7b2JqZWN0SWQ9ODM1OGQ3OWUtNjAzMC00M2Q3LThjNmYtNzE4NWVlNDE0ODJlO3N1YnNjcmlwdGlvbklkPWJlNGU4MmZmLWJmODMtNDE3My1hNzUwLTE1ZTgwNzg0NTU3OTt0ZW5hbnRJZD1hZWFkZThjNC1kNGY3LTRhZTctOTE0OS00OTc1ZmEzYTdmOTE=]
module.identities.data.azurerm_role_definition.acr_pull: Reading...
module.identities.data.azurerm_role_definition.contributor: Read complete after 1s [id=/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c]
module.identities.azurerm_resource_group.sensitive: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive]
module.identities.data.azurerm_role_definition.reader: Read complete after 1s [id=/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7]
module.vnet.modtm_telemetry.telemetry[0]: Refreshing state... [id=e3830665-5033-472d-b083-dac2e3d36b94]
module.identities.data.azurerm_role_definition.acr_pull: Read complete after 1s [id=/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d]
module.identities.azurerm_role_definition.emergency_admin: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/6919f4e6-ac60-273a-799b-6391a47c5637|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.vnet.azapi_resource.vnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001]
module.identities.azurerm_role_definition.vnet_subnet_access: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/18b04605-8a08-943f-d7f4-cd94bb6825a2|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.identities.data.azuread_user.telemetry_observer["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Read complete after 1s [id=/users/084a1c45-5010-4aab-bab6-7b86a9d10e5c]
module.identities.azurerm_role_definition.acr_puller: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/a28645e6-e3b5-d06a-efae-cf6c1f7a02ce|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.identities.azurerm_role_assignment.acrpush_terraform: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/5e0d0b65-123e-ab0c-da84-5b7be21f50b8]
module.identities.azurerm_user_assigned_identity.document_intelligence_identity: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/document-intelligence-identity]
module.identities.data.azuread_user.telemetry_observer["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Read complete after 2s [id=/users/4b89a1f0-8038-4929-81e6-6d128dac7aa0]
module.identities.azurerm_role_definition.telemetry_observer: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/86d4fe1f-e563-db50-5c22-229bbed694a1|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.identities.data.azurerm_kubernetes_cluster.cluster: Reading...
module.identities.azurerm_user_assigned_identity.aks_workload_identity: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity]
module.identities.azurerm_user_assigned_identity.ingestion_cache_identity: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ingestion-cache-identity]
module.identities.data.azuread_user.telemetry_observer["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Read complete after 1s [id=/users/45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff]
module.identities.azurerm_user_assigned_identity.psql_identity: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.ManagedIdentity/userAssignedIdentities/psql-identity]
module.identities.azurerm_role_definition.devops_preview: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/73e3f81e-c41c-319c-1e56-9a0e5b13a949|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.identities.azurerm_role_definition.sensitive_data_observer: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Authorization/roleDefinitions/69aa2ed3-0bfc-6241-9c7f-99025a1ca95c|/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.identities.azurerm_user_assigned_identity.ingestion_storage_identity: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ingestion-storage-identity]
module.identities.azurerm_role_assignment.telemetry_observer_users["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/ea76149a-094f-65c7-6016-dee28f4b72d8]
module.identities.azurerm_role_assignment.telemetry_observer_users["3b48f167-cb68-4655-b45b-878e170af84d"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/2c73714b-80cb-20a0-a388-954e40792699]
module.identities.azurerm_role_assignment.telemetry_observer_users["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/7d00f0e9-e70e-93c3-422c-1594569674d8]
module.identities.azurerm_role_assignment.telemetry_observer_users["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/48754221-b94f-56cc-f42c-e2f3486d7044]
module.identities.azurerm_role_assignment.telemetry_observer_group: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/231d6d8f-72c7-1496-027b-eead4944ee32]
module.perimeter.data.azurerm_subscription.current: Reading...
module.perimeter.azurerm_resource_provider_registration.azure_monitor_provider: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Monitor]
module.perimeter.azurerm_resource_provider_registration.azure_dashboard_provider: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Dashboard]
module.perimeter.azurerm_resource_provider_registration.azure_alerts_provider: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.AlertsManagement]
module.perimeter.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579]
module.perimeter.data.azurerm_resource_group.core: Reading...
module.perimeter.azurerm_dns_zone.dns_zone: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev]
module.perimeter.azurerm_public_ip.aks_public_ip: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/publicIPAddresses/aks_public_ip]
module.perimeter.data.azurerm_resource_group.sensitive: Reading...
module.perimeter.azurerm_private_dns_zone.psql_private_dns_zone: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/privateDnsZones/psql.postgres.database.azure.com]
module.perimeter.data.azuread_service_principal.terraform: Reading...
module.identities.azurerm_role_assignment.aks_workload_identity_cognitive_services_user: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/ce449bf6-a908-a5ed-c8b2-8c033f6e3a1c]
module.perimeter.data.azurerm_resource_group.core: Read complete after 0s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core]
module.perimeter.azurerm_consumption_budget_subscription.subscription_budget: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Consumption/budgets/subscription_budget]
module.perimeter.azurerm_key_vault.main_kv: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain]
module.perimeter.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics]
module.perimeter.module.defender.azapi_resource.security_contact: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Security/securityContacts/default]
module.perimeter.module.defender.azurerm_security_center_subscription_pricing.standard_plan["Arm"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Security/pricings/Arm]
module.perimeter.data.azurerm_resource_group.sensitive: Read complete after 1s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive]
module.perimeter.module.defender.azurerm_security_center_subscription_pricing.standard_plan["CloudPosture"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Security/pricings/CloudPosture]
module.perimeter.module.defender.azurerm_security_center_subscription_pricing.standard_plan["Containers"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Security/pricings/Containers]
module.perimeter.module.defender.azurerm_security_center_subscription_pricing.standard_plan["KeyVaults"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Security/pricings/KeyVaults]
module.perimeter.module.defender.azurerm_security_center_subscription_pricing.standard_plan["OpenSourceRelationalDatabases"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Security/pricings/OpenSourceRelationalDatabases]
module.perimeter.module.defender.azurerm_security_center_subscription_pricing.standard_plan["StorageAccounts"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Security/pricings/StorageAccounts]
module.perimeter.module.defender.azurerm_security_center_subscription_pricing.standard_plan["VirtualMachines"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/providers/Microsoft.Security/pricings/VirtualMachines]
module.identities.module.application_registration.azuread_application.this: Refreshing state... [id=/applications/6b6c2e49-db15-4500-8491-928091137273]
module.identities.data.azurerm_kubernetes_cluster.cluster: Read complete after 2s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster]
module.perimeter.azurerm_key_vault.sensitive_kv: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive]
module.perimeter.data.azuread_service_principal.terraform: Read complete after 1s [id=/servicePrincipals/8358d79e-6030-43d7-8c6f-7185ee41482e]
module.identities.azurerm_role_assignment.cluster_user_group: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/9de7bf4a-ec85-f03a-59b6-274eab218c32]
module.identities.azurerm_role_assignment.dns_contributor: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/providers/Microsoft.Authorization/roleAssignments/cb9a2df6-8bc1-ffaa-af34-6b5c7bf91c95]
module.identities.azurerm_role_assignment.application_gateway_ingres_controller_vnet_subnet_access: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Authorization/roleAssignments/103249c1-9572-b59a-f7c4-17e1053fa5b7]
module.identities.azurerm_role_assignment.cluster_user_terraform: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/7a97bdc3-aeac-453e-1d78-75f938ed2796]
module.identities.azurerm_role_assignment.cluster_rbac_admin_terraform: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/094899a2-3980-a81b-b5e8-08c2d025103e]
module.identities.azurerm_role_assignment.kubelet_identity_acr_puller_assignment: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/93b4b66c-faac-6bbe-5a5b-3f6e0932179c]
module.identities.azurerm_role_assignment.application_gateway_ingres_controller_reader_role: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Authorization/roleAssignments/f1e3c786-9be5-9969-fa6b-ab15b466badd]
module.identities.azurerm_role_assignment.cluster_rbac_admin_users["3b48f167-cb68-4655-b45b-878e170af84d"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/f8f61afb-b211-ce47-7db5-c47d24cb1bc8]
module.identities.azurerm_role_assignment.cluster_rbac_admin_users["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/7b2d660d-8021-f764-5832-67625696f761]
module.identities.azurerm_role_assignment.cluster_rbac_admin_users["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/1ed65e05-22f6-a206-d4ac-16d77c27d7fb]
module.identities.azurerm_role_assignment.cluster_rbac_admin_users["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/9a56434b-d165-a3ef-be5e-f328c4ec6a7b]
module.identities.azurerm_role_assignment.cluster_rbac_admin_group: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/71e93068-e9df-4b17-a57a-628882703714]
module.identities.azurerm_role_assignment.cluster_user_users["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/3558e375-74b0-6d9d-2214-183b1ad264d2]
module.identities.azurerm_role_assignment.cluster_user_users["3b48f167-cb68-4655-b45b-878e170af84d"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/05268ad7-36b6-8e87-c81f-a05f14afa5ca]
module.identities.azurerm_role_assignment.cluster_user_users["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/e9664c88-1f64-717a-87c0-2561bd325695]
module.identities.azurerm_role_assignment.cluster_user_users["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Authorization/roleAssignments/90aa7b11-e028-396f-0d8b-da49c1499fb0]
module.perimeter.azurerm_private_dns_zone_virtual_network_link.psql-private-dns-zone-vnet-link: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/privateDnsZones/psql.postgres.database.azure.com/virtualNetworkLinks/PsqlVnetZone.com]
module.vnet.module.subnet["snet-aks-nodes"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-nodes]
module.vnet.module.subnet["snet-redis"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-redis]
module.vnet.module.subnet["snet-agw"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-application-gateway]
module.vnet.module.subnet["snet-github"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-github-runners]
module.vnet.module.subnet["snet-aks-pods"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-aks-pods]
module.vnet.module.subnet["snet-cognitive"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-cognitive-services]
module.vnet.module.subnet["snet-psql"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-postgres]
module.vnet.module.subnet["snet-kv"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-key-vault]
module.vnet.module.subnet["snet-storage"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-storage]
module.identities.module.application_registration.azuread_application_password.aad_app_password: Refreshing state... [id=6b6c2e49-db15-4500-8491-928091137273/password/e8eeba88-335e-4063-939f-d044a0db5696]
module.identities.module.application_registration.azuread_application_app_role.maintainers: Refreshing state... [id=/applications/6b6c2e49-db15-4500-8491-928091137273/appRoles/ef3d0c8a-98a1-7d1e-2c10-18f0815bd6c7]
module.identities.module.application_registration.azuread_service_principal.this: Refreshing state... [id=/servicePrincipals/9be59ff9-066e-4ec1-bd1f-c784a0b35222]
module.workloads.random_password.encryption_key_app_repository: Refreshing state... [id=none]
module.identities.azurerm_role_assignment.kv_main_access_administrator_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/42f09b09-1602-97f0-5657-16127e654dfa]
module.identities.azurerm_role_assignment.csi_identity_secret_reader_main_kv: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/71de4fe2-d61d-7272-2e11-d882a6a4c5f1]
module.workloads.random_id.encryption_key_ingestion: Refreshing state... [id=WQqMaiJNHxeaxf_WdZftUZBNDhC4qB8uNDLmmgLZKXo]
module.workloads.random_password.postgres_username: Refreshing state... [id=none]
module.workloads.data.azurerm_client_config.current: Reading...
module.workloads.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hMGUzNGJhMC1iNjRjLTQ5ZjQtOGQ5NC0xYzc0ZDdiMzA5MGU7b2JqZWN0SWQ9ODM1OGQ3OWUtNjAzMC00M2Q3LThjNmYtNzE4NWVlNDE0ODJlO3N1YnNjcmlwdGlvbklkPWJlNGU4MmZmLWJmODMtNDE3My1hNzUwLTE1ZTgwNzg0NTU3OTt0ZW5hbnRJZD1hZWFkZThjNC1kNGY3LTRhZTctOTE0OS00OTc1ZmEzYTdmOTE=]
module.identities.azurerm_role_assignment.ingestion_storage_kv_secrets_reader: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/1e67574e-721e-0aba-6b2c-fb2c1f07f4f6]
module.identities.azurerm_role_assignment.psql_identity_role_assignment: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/21c1a0eb-b55f-ed53-4665-6bdc245d3824]
module.identities.azurerm_role_assignment.ingestion_storage_kv_key_reader: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/39533832-cb83-89fb-6f5b-db9b5fae26d2]
module.identities.azurerm_role_assignment.ingestion_cache_kv_secrets_reader: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/df7d7f10-7ad1-3be9-9014-85b69b3d9146]
module.identities.azurerm_role_assignment.kv_crypto_officer_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/a75dfb6b-d8eb-ab20-322b-3972fa69cd9d]
module.workloads.data.azurerm_resource_group.core: Reading...
module.identities.azurerm_role_assignment.main_keyvault_secret_manager_users["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/965a0c0b-9e8d-e934-2b99-f7cd727ab756]
module.identities.azurerm_role_assignment.main_keyvault_secret_manager_users["3b48f167-cb68-4655-b45b-878e170af84d"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/d797a4ea-7700-a9f5-9e47-d93924469e66]
module.identities.azurerm_role_assignment.main_keyvault_secret_manager_users["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/9b30e3b5-f77f-a011-6520-2ccf7d78fef9]
module.identities.azurerm_role_assignment.main_keyvault_secret_manager_users["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/6101cbe9-d470-9ecb-730e-8f344170d3f5]
module.identities.azurerm_role_assignment.ingestion_cache_kv_key_reader: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/da8e3767-94e8-1bed-d548-810404e2cc88]
module.workloads.data.azurerm_resource_group.core: Read complete after 0s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core]
module.identities.azurerm_role_assignment.kv_access_administrator_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/75d91065-c418-b3d6-edbe-df07b24a5de3]
module.identities.azurerm_role_assignment.main_keyvault_key_reader_users["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/ece05de4-9d01-e620-f677-6e3051cf4eae]
module.identities.azurerm_role_assignment.csi_identity_secret_reader: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/fc8755b4-3b28-09d4-958b-02a455a61de4]
module.identities.azurerm_role_assignment.main_keyvault_secret_manager_group: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/3b647e15-e13b-1bdf-8486-ea2b6783926c]
module.identities.azurerm_role_assignment.main_keyvault_key_reader_users["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/e8a9af5e-a205-6ed1-1542-d2d10d30e24f]
module.identities.azurerm_role_assignment.main_keyvault_key_reader_users["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/efa83cc1-7c77-3d7d-24ef-1ae1899909f6]
module.identities.azurerm_role_assignment.main_keyvault_key_reader_users["3b48f167-cb68-4655-b45b-878e170af84d"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/c2a62998-6ab6-6c8e-f52c-2467a001775a]
module.workloads.random_password.zitadel_db_user_password: Refreshing state... [id=none]
module.workloads.random_password.postgres_password: Refreshing state... [id=none]
module.workloads.random_id.encryption_key_node_chat_lxm: Refreshing state... [id=z0Y2Y8gkXtmFyy4NQWtCd93iUMwXIkccgkRbwku6jTI]
module.workloads.random_password.rabbitmq_password_chat: Refreshing state... [id=none]
module.workloads.random_password.zitadel_master_key: Refreshing state... [id=none]
module.identities.azurerm_role_assignment.kv_secrets_officer_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.KeyVault/vaults/helloazuresensitive/providers/Microsoft.Authorization/roleAssignments/8293a17a-1dc6-ae20-0aa4-886a5061f79a]
module.identities.azurerm_role_assignment.kv_main_crypto_officer_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/0fab207f-5718-9f61-c5ec-01509167a8ed]
module.identities.azurerm_role_assignment.kv_main_secrets_officer_terraform_assign: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.KeyVault/vaults/helloazuremain/providers/Microsoft.Authorization/roleAssignments/df45b6ec-315a-df28-00fe-f5355d0bc759]
module.identities.module.application_registration.azurerm_key_vault_secret.aad_app_gitops_client_id: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/aad-app-hello-azure-gitops-client-id/e44fd580241a4cd09957ddd5e04fecc2]
module.workloads.data.azurerm_resource_group.sensitive: Reading...
module.workloads.azurerm_key_vault_secret.zitadel_pat: Refreshing state... [id=https://helloazuremain.vault.azure.net/secrets/manual-zitadel-scope-mgmt-pat/911cf66c91f5441293c6bc5323bde1dc]
module.workloads.azurerm_key_vault_secret.encryption_key_app_repository: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/encryption-key-app-repository/ecb4a6137af94e258f033644c90b63d2]
module.workloads.azurerm_key_vault_secret.encryption_key_ingestion: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/encryption-key-ingestion/8e6a78709e3a4879adaba5e7babf61fe]
module.identities.module.application_registration.azurerm_key_vault_secret.aad_app_gitops_client_secret: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/aad-app-hello-azure-gitops-client-secret/e35b6b85ee6f445db9c7052e1034e22a]
module.workloads.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerRegistry/registries/uniquehelloazure]
module.workloads.azurerm_key_vault_secret.zitadel_db_user_password: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/zitadel-db-user-password/f523958b5faf4f42b92e3bd63017ecb9]
module.workloads.azurerm_key_vault_secret.encryption_key_node_chat_lxm: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/encryption-key-chat-lxm/c5daa93c7e6b469fbcd2a9ff2ac317d2]
module.workloads.azurerm_key_vault_secret.rabbitmq_password_chat: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/rabbitmq-password-chat/c8e9eb63974843b9af6a03f8c9549964]
module.workloads.data.azurerm_resource_group.sensitive: Read complete after 0s [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive]
module.workloads.azurerm_key_vault_secret.zitadel_master_key: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/zitadel-master-key/06d9b867251e49388ae22b10f0f9249e]
module.identities.module.application_registration.azuread_app_role_assignment.maintainers["45caeab6-e1dd-4f9a-aa0c-ea1fb6c0c5ff"]: Refreshing state... [id=/servicePrincipals/9be59ff9-066e-4ec1-bd1f-c784a0b35222/appRoleAssignedTo/turKRd3hmk-qDOoftsDF_9rjzJS0xvBOuCx_v-R3Ick]
module.identities.module.application_registration.azuread_app_role_assignment.maintainers["4b89a1f0-8038-4929-81e6-6d128dac7aa0"]: Refreshing state... [id=/servicePrincipals/9be59ff9-066e-4ec1-bd1f-c784a0b35222/appRoleAssignedTo/8KGJSziAKUmB5m0Sjax6oDLmhnY5-g5Immey6TbletI]
module.identities.module.application_registration.azuread_app_role_assignment.maintainers["084a1c45-5010-4aab-bab6-7b86a9d10e5c"]: Refreshing state... [id=/servicePrincipals/9be59ff9-066e-4ec1-bd1f-c784a0b35222/appRoleAssignedTo/RRxKCBBQq0q6tnuGqdEOXLp7J-MOv-NPkQe2iH9dLPA]
module.identities.module.application_registration.azuread_app_role_assignment.maintainers["3b48f167-cb68-4655-b45b-878e170af84d"]: Refreshing state... [id=/servicePrincipals/9be59ff9-066e-4ec1-bd1f-c784a0b35222/appRoleAssignedTo/Z_FIO2jLVUa0W4eOFwr4TfXlHhG9Gl9Kkzst97V-2tc]
module.workloads.module.kubernetes_cluster.azurerm_log_analytics_workspace_table.basic_log_table["AKSControlPlane"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics/tables/AKSControlPlane]
module.workloads.module.kubernetes_cluster.azurerm_log_analytics_workspace_table.basic_log_table["ContainerLogV2"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics/tables/ContainerLogV2]
module.workloads.module.kubernetes_cluster.azurerm_monitor_workspace.monitor_workspace[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Monitor/accounts/aks-cluster-monitor]
module.workloads.module.kubernetes_cluster.azurerm_monitor_data_collection_endpoint.monitor_dce[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Insights/dataCollectionEndpoints/aks-cluster-monitor-dce]
module.workloads.module.ingestion_storage.azurerm_key_vault_key.storage-account-byok[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/keys/ingestion-storage-cmk/f0126fe4a4ce4c2990ac0845a3998e77]
module.workloads.module.ingestion_cache.azurerm_key_vault_key.storage-account-byok[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/keys/ingestion-cache-cmk/dfa37303ba3149aa917102f82cc29b4c]
module.workloads.module.document_intelligence.azurerm_cognitive_account.aca["swedencentral-form-recognizer"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.CognitiveServices/accounts/doc-intelligence-swedencentral-form-recognizer]
module.workloads.module.application_gateway.azurerm_public_ip.appgw[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/publicIPAddresses/default-public-ip-name]
module.workloads.module.kubernetes_cluster.azurerm_monitor_data_collection_rule.ci_dcr: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Insights/dataCollectionRules/aks-cluster-ci-dcr]
module.workloads.module.openai.azurerm_cognitive_account.aca["cognitive-account-swedencentral"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.CognitiveServices/accounts/cognitive-account-swedencentral]
module.workloads.module.ingestion_storage.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Storage/storageAccounts/helloazureingstorage]
module.workloads.module.redis.azurerm_redis_cache.arc: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Cache/redis/uniquehelloazureredis]
module.workloads.module.ingestion_cache.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Storage/storageAccounts/helloazureingcache]
module.workloads.module.postgresql.azurerm_key_vault_secret.username[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/hello-azure-psql-username/73826d10fc334cce9491ffa8d290ed98]
module.workloads.module.postgresql.azurerm_key_vault_secret.port[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/hello-azure-psql-port/392bb03e0c394737936d4a35230213cf]
module.workloads.module.postgresql.azurerm_key_vault_secret.password[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/hello-azure-psql-password/6b08e7ce0b0f4347a9b799b51863021b]
module.workloads.module.kubernetes_cluster.azurerm_dashboard_grafana.grafana[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Dashboard/grafana/aks-cluster-grafana]
module.workloads.module.application_gateway.azurerm_web_application_firewall_policy.wafpolicy[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/default-waf-policy-name]
module.workloads.module.kubernetes_cluster.azurerm_monitor_data_collection_rule.monitor_dcr[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Insights/dataCollectionRules/aks-cluster-monitor-dcr]
module.workloads.azurerm_monitor_diagnostic_setting.acr_diagnostic[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerRegistry/registries/uniquehelloazure|log-helloazure]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server.apfs: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql]
module.workloads.module.openai.azurerm_cognitive_deployment.deployments["cognitive-account-swedencentral-gpt-35-turbo-0125"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.CognitiveServices/accounts/cognitive-account-swedencentral/deployments/gpt-35-turbo-0125]
module.workloads.module.openai.azurerm_cognitive_deployment.deployments["cognitive-account-swedencentral-text-embedding-ada-002"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.CognitiveServices/accounts/cognitive-account-swedencentral/deployments/text-embedding-ada-002]
module.workloads.module.openai.azurerm_cognitive_deployment.deployments["cognitive-account-swedencentral-gpt-4"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.CognitiveServices/accounts/cognitive-account-swedencentral/deployments/gpt-4]
module.workloads.module.openai.azurerm_key_vault_secret.endpoint["cognitive-account-swedencentral"]: Refreshing state... [id=https://helloazuremain.vault.azure.net/secrets/cognitive-account-swedencentral-ep/8e38bdce578e490ab3ffbfe204121753]
module.perimeter.azurerm_dns_a_record.adnsar_root: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/@]
module.workloads.module.document_intelligence.azurerm_key_vault_secret.key["swedencentral-form-recognizer"]: Refreshing state... [id=https://helloazuremain.vault.azure.net/secrets/swedencentral-form-recognizer-key/db9740a106424d7a81cda91c38b92ded]
module.perimeter.azurerm_dns_a_record.adnsar_sub_domains["argo"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/argo]
module.perimeter.azurerm_dns_a_record.adnsar_sub_domains["api"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/api]
module.perimeter.azurerm_dns_a_record.adnsar_sub_domains["zitadel"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/id]
module.workloads.module.postgresql.azurerm_key_vault_secret.host[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/hello-azure-psql-host/64628f77b18f4dfa85a0b4590d4ca4a2]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_configuration.parameters["max_connections"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/configurations/max_connections]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_configuration.parameters["azure.extensions"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/configurations/azure.extensions]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_configuration.parameters["enable_seqscan"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/configurations/enable_seqscan]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_database.destructible_database_server["scope-management"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/databases/scope-management]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_database.destructible_database_server["theme"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/databases/theme]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_database.destructible_database_server["chat"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/databases/chat]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_database.destructible_database_server["ingestion"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/databases/ingestion]
module.workloads.module.postgresql.azurerm_postgresql_flexible_server_database.destructible_database_server["app-repository"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.DBforPostgreSQL/flexibleServers/hello-azure-psql/databases/app-repository]
module.workloads.module.postgresql.azurerm_key_vault_secret.database_connection_strings["app-repository"]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/database-url-app-repository/e1b17d68a9ff452780175926b9dd417a]
module.workloads.module.postgresql.azurerm_key_vault_secret.database_connection_strings["ingestion"]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/database-url-ingestion/9fccbe3e56dc448cb3bff42f892f14d4]
module.workloads.module.postgresql.azurerm_key_vault_secret.database_connection_strings["chat"]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/database-url-chat/9defc1348794495d8c86795cb87a998c]
module.workloads.module.postgresql.azurerm_key_vault_secret.database_connection_strings["theme"]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/database-url-theme/77d0c6a961ba4d629d5d042374270fbb]
module.workloads.module.postgresql.azurerm_key_vault_secret.database_connection_strings["scope-management"]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/database-url-scope-management/6c36091a210b40579e0a1a2779bf8b77]
module.workloads.module.document_intelligence.azurerm_key_vault_secret.azure_document_intelligence_endpoint_definitions[0]: Refreshing state... [id=https://helloazuremain.vault.azure.net/secrets/azure-document-intelligence-endpoint-definitions/95ceca14d321407087176de7d2fb724b]
module.workloads.module.document_intelligence.azurerm_key_vault_secret.azure_document_intelligence_endpoints[0]: Refreshing state... [id=https://helloazuremain.vault.azure.net/secrets/azure-document-intelligence-endpoints/e2d241730b1141a2890f9528ba47ff54]
module.workloads.module.openai.azurerm_key_vault_secret.model_version_endpoints[0]: Refreshing state... [id=https://helloazuremain.vault.azure.net/secrets/azure-openai-endpoint-definitions/ef9ced6b23744c85851b08775e141b9f]
module.workloads.module.application_gateway.azurerm_application_gateway.appgw: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/applicationGateways/hello-azure-appgw]
module.workloads.module.application_gateway.azurerm_monitor_diagnostic_setting.agw_diagnostic[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/applicationGateways/hello-azure-appgw|log-hello-azure-appgw]
module.identities.azurerm_role_assignment.application_gateway_ingres_controller_contributor_role: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/applicationGateways/hello-azure-appgw/providers/Microsoft.Authorization/roleAssignments/f4ef5fc2-fdc3-3587-b96d-f708f3044acc]
module.workloads.module.kubernetes_cluster.azurerm_kubernetes_cluster.cluster: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster]
module.workloads.module.ingestion_cache.azurerm_storage_account_customer_managed_key.storage_account_cmk[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Storage/storageAccounts/helloazureingcache]
module.workloads.module.ingestion_cache.azurerm_key_vault_secret.storage-account-connection-string-1[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/ingestion-cache-connection-string-1/4bf7e7fb3a684782a89289be88ec4bad]
module.workloads.module.ingestion_cache.azurerm_key_vault_secret.storage-account-connection-string-2[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/ingestion-cache-connection-string-2/9c4c292887144914bd68672a49a699dd]
module.workloads.module.ingestion_cache.azurerm_storage_management_policy.default[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Storage/storageAccounts/helloazureingcache/managementPolicies/default]
module.workloads.module.redis.azurerm_key_vault_secret.redis-cache-port[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/uniquehelloazureredis-port/d730f56739344097b051e5d6339b4d05]
module.workloads.module.redis.azurerm_key_vault_secret.redis-cache-password[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/uniquehelloazureredis-password/f8f0a6c566554a429159e0dbc1c5fe7c]
module.workloads.module.redis.azurerm_key_vault_secret.redis-cache-host[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/uniquehelloazureredis-host/bb6c3931b41046669570598424e0065b]
module.workloads.module.ingestion_storage.azurerm_key_vault_secret.storage-account-connection-string-2[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/ingestion-storage-connection-string-2/52d4050451d34d4f9a2631e2c9177c87]
module.workloads.module.ingestion_storage.azurerm_storage_account_customer_managed_key.storage_account_cmk[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Storage/storageAccounts/helloazureingstorage]
module.workloads.module.ingestion_storage.azurerm_key_vault_secret.storage-account-connection-string-1[0]: Refreshing state... [id=https://helloazuresensitive.vault.azure.net/secrets/ingestion-storage-connection-string-1/0cd0f919e8c34f64bbca1d8d931ba7ab]
module.workloads.module.ingestion_storage.azurerm_storage_management_policy.default[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-sensitive/providers/Microsoft.Storage/storageAccounts/helloazureingstorage/managementPolicies/default]
module.workloads.module.kubernetes_cluster.azurerm_monitor_data_collection_rule_association.monitor_dcr_asc[0]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Insights/dataCollectionRuleAssociations/aks-cluster-monitor-dcr-asc]
module.workloads.module.kubernetes_cluster.azurerm_monitor_data_collection_rule_association.ci_dcr_asc: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/providers/Microsoft.Insights/dataCollectionRuleAssociations/aks-cluster-ci-dcr-asc]
module.workloads.module.kubernetes_cluster.azurerm_kubernetes_cluster_node_pool.node_pool["steady"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/agentPools/steady]
module.workloads.module.kubernetes_cluster.azurerm_kubernetes_cluster_node_pool.node_pool["rapid"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster/agentPools/rapid]
module.workloads.module.kubernetes_cluster.azurerm_monitor_alert_prometheus_rule_group.node_level_alerts: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.AlertsManagement/prometheusRuleGroups/aks-cluster-node-level-alerts]
module.identities.azurerm_federated_identity_credential.afic_workloads["backend-service-ingestion"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity/federatedIdentityCredentials/backend-service-ingestion]
module.identities.azurerm_federated_identity_credential.afic_workloads["backend-service-chat"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity/federatedIdentityCredentials/backend-service-chat]
module.workloads.module.kubernetes_cluster.azurerm_monitor_diagnostic_setting.aks_diagnostic_logs: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster|aks-diagnostic-logs]
module.workloads.module.kubernetes_cluster.azurerm_monitor_alert_prometheus_rule_group.cluster_level_alerts: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.AlertsManagement/prometheusRuleGroups/aks-cluster-cluster-level-alerts]
module.workloads.module.kubernetes_cluster.azurerm_monitor_alert_prometheus_rule_group.pod_level_alerts: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.AlertsManagement/prometheusRuleGroups/aks-cluster-pod-level-alerts]
module.identities.azurerm_federated_identity_credential.afic_workloads["backend-service-ingestion-worker"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity/federatedIdentityCredentials/backend-service-ingestion-worker]
module.identities.azurerm_federated_identity_credential.afic_workloads["assistants-core"]: Refreshing state... [id=/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity/federatedIdentityCredentials/assistants-core]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vnet.azapi_resource.vnet has changed
  ~ resource "azapi_resource" "vnet" {
        id                        = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001"
        name                      = "vnet-001"
      ~ output                    = {
            id         = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001"
          ~ properties = {
              ~ subnets           = [
                    # (1 unchanged element hidden)
                    {
                        properties = {
                            addressPrefixes   = [
                                "10.201.3.80/28",
                            ]
                            provisioningState = "Succeeded"
                        }
                    },
                  ~ {
                      ~ properties = {
                          - applicationGatewayIPConfigurations = [
                              - {},
                            ]
                          - ipConfigurations                   = [
                              - {},
                            ]
                            # (2 unchanged attributes hidden)
                        }
                    },
                    {
                        properties = {
                            addressPrefixes   = [
                                "10.201.3.32/28",
                            ]
                            provisioningState = "Succeeded"
                        }
                    },
                    # (5 unchanged elements hidden)
                ]
                # (3 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vnet.module.subnet["snet-agw"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
        id                        = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-application-gateway"
        name                      = "snet-application-gateway"
      ~ output                    = {
            id         = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-application-gateway"
          ~ properties = {
              - applicationGatewayIPConfigurations = [
                  - {},
                ]
              - ipConfigurations                   = [
                  - {},
                ]
                # (2 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.workloads.module.application_gateway.azurerm_application_gateway.appgw has been deleted
  - resource "azurerm_application_gateway" "appgw" {
      - id                                = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/applicationGateways/hello-azure-appgw" -> null
        name                              = "hello-azure-appgw"
        tags                              = {
            "app"                    = "hello-azure"
            "managed-by-k8s-ingress" = "1.8.0/cedee9ff/2025-02-11-13:32T-0800"
        }
        # (8 unchanged attributes hidden)

        # (44 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.identities.azurerm_role_assignment.application_gateway_ingres_controller_contributor_role will be created
  + resource "azurerm_role_assignment" "application_gateway_ingres_controller_contributor_role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "92b5e28e-6455-44c7-9443-7cce89f54d55"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.perimeter.azurerm_dns_a_record.adnsar_root will be updated in-place
  ~ resource "azurerm_dns_a_record" "adnsar_root" {
        id                  = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/@"
        name                = "@"
      ~ records             = [
          - "9.223.9.125",
          + "10.201.3.6",
        ]
        tags                = {
            "app" = "hello-azure"
        }
        # (5 unchanged attributes hidden)
    }

  # module.perimeter.azurerm_dns_a_record.adnsar_sub_domains["api"] will be updated in-place
  ~ resource "azurerm_dns_a_record" "adnsar_sub_domains" {
        id                  = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/api"
        name                = "api"
      ~ records             = [
          - "9.223.9.125",
          + "10.201.3.6",
        ]
        tags                = {
            "app" = "hello-azure"
        }
        # (5 unchanged attributes hidden)
    }

  # module.perimeter.azurerm_dns_a_record.adnsar_sub_domains["argo"] will be updated in-place
  ~ resource "azurerm_dns_a_record" "adnsar_sub_domains" {
        id                  = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/argo"
        name                = "argo"
      ~ records             = [
          - "9.223.9.125",
          + "10.201.3.6",
        ]
        tags                = {
            "app" = "hello-azure"
        }
        # (5 unchanged attributes hidden)
    }

  # module.perimeter.azurerm_dns_a_record.adnsar_sub_domains["zitadel"] will be updated in-place
  ~ resource "azurerm_dns_a_record" "adnsar_sub_domains" {
        id                  = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/dnsZones/hello.azure.unique.dev/A/id"
        name                = "id"
      ~ records             = [
          - "9.223.9.125",
          + "10.201.3.6",
        ]
        tags                = {
            "app" = "hello-azure"
        }
        # (5 unchanged attributes hidden)
    }

  # module.workloads.module.application_gateway.azurerm_application_gateway.appgw will be created
  + resource "azurerm_application_gateway" "appgw" {
      + enable_http2                = true
      + firewall_policy_id          = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/default-waf-policy-name"
      + id                          = (known after apply)
      + location                    = "swedencentral"
      + name                        = "hello-azure-appgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "resource-group-core"
      + tags                        = {
          + "app" = "hello-azure"
        }

      + autoscale_configuration {
          + max_capacity = 2
          + min_capacity = 1
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "hello-azure-beap"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "hello-azure-be-htst"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
            # (4 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "hello-azure-privatefeip"
          + private_ip_address            = "10.201.3.6"
          + private_ip_address_allocation = "Static"
          + private_link_configuration_id = (known after apply)
          + subnet_id                     = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-application-gateway"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "hello-azure-feport"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "hello-azure-gwip"
          + subnet_id = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/rg-vnet-002/providers/Microsoft.Network/virtualNetworks/vnet-001/subnets/snet-application-gateway"
        }

      + global {
          + request_buffering_enabled  = true
          + response_buffering_enabled = false
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "hello-azure-privatefeip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "hello-azure-feport"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "hello-azure-httplstn"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (4 unchanged attributes hidden)
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "hello-azure-beap"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "hello-azure-be-htst"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "hello-azure-httplstn"
          + id                          = (known after apply)
          + name                        = "hello-azure-rqrt"
          + priority                    = 19500
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + rewrite_rule_set {
          + id   = (known after apply)
          + name = "security-headers"

          + rewrite_rule {
              + name          = "set-hsts-header"
              + rule_sequence = 100

              + response_header_configuration {
                  + header_name  = "Strict-Transport-Security"
                  + header_value = "max-age=31536000; includeSubDomains"
                }
            }
          + rewrite_rule {
              + name          = "set-nosniff-header"
              + rule_sequence = 101

              + response_header_configuration {
                  + header_name  = "X-Content-Type-Options"
                  + header_value = "nosniff"
                }
            }
          + rewrite_rule {
              + name          = "set-xss-header"
              + rule_sequence = 102

              + response_header_configuration {
                  + header_name  = "X-XSS-Protection"
                  + header_value = "1; mode=block"
                }
            }
          + rewrite_rule {
              + name          = "set-ref-header"
              + rule_sequence = 103

              + response_header_configuration {
                  + header_name  = "Referrer-Policy"
                  + header_value = "same-origin"
                }
            }
          + rewrite_rule {
              + name          = "delete-server-header"
              + rule_sequence = 104

              + response_header_configuration {
                  + header_name  = "Server"
                    # (1 unchanged attribute hidden)
                }
            }
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_policy {
          + policy_name = "AppGwSslPolicy20220101"
          + policy_type = "Predefined"
        }
    }

  # module.workloads.module.application_gateway.azurerm_monitor_diagnostic_setting.agw_diagnostic[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "agw_diagnostic" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.OperationalInsights/workspaces/loganalytics"
      + name                           = "log-hello-azure-appgw"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false
        }
    }

  # module.workloads.module.application_gateway.azurerm_public_ip.appgw[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_public_ip" "appgw" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/publicIPAddresses/default-public-ip-name" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "9.223.9.125" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "swedencentral" -> null
      - name                    = "default-public-ip-name" -> null
      - resource_group_name     = "resource-group-core" -> null
      - sku                     = "Standard" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {
          - "app" = "hello-azure"
        } -> null
      - zones                   = [
          - "1",
          - "2",
          - "3",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.workloads.module.kubernetes_cluster.azurerm_kubernetes_cluster.cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "cluster" {
        id                                  = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.ContainerService/managedClusters/aks-cluster"
        name                                = "aks-cluster"
        tags                                = {
            "app" = "hello-azure"
        }
        # (35 unchanged attributes hidden)

      ~ ingress_application_gateway (known after apply)
      - ingress_application_gateway {
          - effective_gateway_id                 = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/applicationGateways/hello-azure-appgw" -> null
          - gateway_id                           = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourceGroups/resource-group-core/providers/Microsoft.Network/applicationGateways/hello-azure-appgw" -> null
          - ingress_application_gateway_identity = [
              - {
                  - client_id                 = "90ab2f6c-10be-40a5-9b37-2d5ce8a6991e"
                  - object_id                 = "92b5e28e-6455-44c7-9443-7cce89f54d55"
                  - user_assigned_identity_id = "/subscriptions/be4e82ff-bf83-4173-a750-15e807845579/resourcegroups/resource-group-core-aks-nodes/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ingressapplicationgateway-aks-cluster"
                },
            ] -> null
            # (3 unchanged attributes hidden)
        }

        # (15 unchanged blocks hidden)
    }

Plan: 3 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @unique-jakub, Action: `pull_request`, Env: ``, Workflow: `[tf] [dev] Infrastructure 🏗️`*